Repository: ArmandoReyes105/Blockus-Client
Catalog: Blockus-Client/Properties/Resources.*.resx
Languages: es_mx

# Global_noAccount
source: Create an account
es_mx: Crear cuenta

# Global_continueButton
source: Continue
es_mx: Continuar

# Global_cancelButton
source: Cancel
es_mx: Cancelar

# Global_okButton
source: Ok
es_mx: Aceptar

# Global_publicMode
source: Game will search for a match you can join.
es_mx: El juego buscará una partida a la cual te podrás unir.

# Global_privateMode
source: Enter the match code shared by the host to be able to play with your friends.
es_mx: Ingrese el código compartido por el anfitrión para poder jugar con tus amigos.

# Login_login
source: Login
es_mx: Iniciar sesión

# Login_guest
source: Play as guest
es_mx: Jugar como invitado

# Login_noAccount
source: Don't have an account? Register here
es_mx: ¿Aún no tienes una cuenta? Registrate aquí

# Register_email
source: Email
es_mx: Correo electrónico

# Register_confirmPassword
source: Confirm your password
es_mx: Confirmar contraseña

# Register_emailRestriction
source: Email must be '@gmail.com'
es_mx: El correo debe ser '@gmail.com'

# Register_signUpNote
source: Note: once you click on 'Continue' an email will be sent to the email address above, with a verification code for the correct creation of your account.
es_mx: Nota: una vez que de clic en 'Continuar' se enviará un correo a la dirección que ingresaste, el cual contiene un código de verificación para la correcta creación de tu cuenta.

# Login_forgotPassword
source: Forgot your password?
es_mx: Olvidé mi contraseña

# Lobby_createMatch
source: CreateMatch
es_mx: Crear partida

# Lobby_joinMatch
source: Join match
es_mx: Unirse a partida

# Lobby_logout
source: Logout
es_mx: Cerrar sesión

# MatchDetails_waitingPlayer
source: Waiting for a player
es_mx: Esperando jugador

# MatchDetails_gameMode
source: Game mode:
es_mx: Modo de juego:

# MatchDetails_private
source: Private
es_mx: Privado

# MatchDetails_public
source: Public
es_mx: Público

# MatchDetails_searchingPlayers
source: Searching for players
es_mx: Buscando jugadores

# MatchDetails_noPlayers
source: Number of players
es_mx: Número de jugadores:

# MatchDetails_note
source: Only players with the match code can join.
es_mx: La partida se llenará solo con jugadores que tengan el código de partida.

# MatchDetails_matchCode
source: Match code:
es_mx: Código de partida:

# JoinMatch_enterCode
source: Enter the code to join a match
es_mx: Ingrese el código para unirse a la partida

# JoinMatch_join
source: Join
es_mx: Unirse

# Friends_addedFriends
source: My friends
es_mx: Amigos agregados

# Friends_searchUser
source: Search by username
es_mx: Busca a un usuario

# Configuration_modifyPassword
source: Change your password
es_mx: Cambiar contraseña

# Configuration_stats
source: Stats
es_mx: Estadísticas

# Configuration_victories
source: Victories
es_mx: Victorias

# Configuration_loses
source: Losses
es_mx: Derrotas

# Configuration_boardStyle
source: Board style
es_mx: Estilo de tablero:

# ModifyPassword_modify
source: Change your password
es_mx: Cambia tu contraseña

# ModifyPassword_actualPassword
source: Current password:
es_mx: Contraseña actual:

# ModifyPassword_newPassword
source: Enter your new password:
es_mx: Ingresa tu nueva contraseña

# ModifyPassword_note
source: NOTE: once your password is modified you will be asked to log in again with your new password.
es_mx: NOTA: una vez modificada tu contraseña se pedirá que inicies sesión con tu nueva contraseña.

# Global_password
source: Password
es_mx: Contraseña

# Global_username
source: Username
es_mx: Nombre de usuario

# Global_language
source: English
es_mx: Español

# Login_log
source: Log in
es_mx: Inicia

# Login_in
source: your account
es_mx: Sesión

# Friends_search
source: Search
es_mx: Buscar

# Error_noConnection
source: An error ocurred while trying to connect to the database, please try it later.
es_mx: Ocurrió un error al conectarse a la base de datos, por favor intente mas tarde.

# Error_unsuccesfulOperation
source: An error ocurred while updating your data, please try again later.
es_mx: Error al actualizar los datos, intente mas tarde.

# Error_noCoincidences
source: The entered data does not match
es_mx: Tu contraseña no coincide.

# Error_samePassword
source: The new password cannot be the same as your current password.
es_mx: Tu contraseña nueva no puede ser igual a la actual.

# Error_specialCharacters
source: Your password must only have letters and/or numbers.
es_mx: Tu contraseña solo debe contener numeros o letras.

# Error_incompleteFields
source: Incomplete fields. Fill in all fields and try again.
es_mx: Campos incompletos. Llene todos los campos e intente nuevamente.

# JoinMatch_noMatches
source: No match found for the entered code.
es_mx: No se encontro ninguna partida que coincida con el codigo ingresado.

# JoinMatch_fullMatch
source: The match you tried to join is already full.
es_mx: La partida a la que intentas unirte esta llena.

# JoinMatch_hostLeft
source: The host has left the match, you will be sent back to the lobby.
es_mx: El anfitrión abandonó la partida, serás llevado al menú principal.

# Error_retrievingData
source: An error ocurred while trying to retrieve your data.
es_mx: Lo sentimos, ocurrió un error al intentar recuperar su información.

# Error_wrongCredentials
source: Wrong credentials
es_mx: Credenciales incorrectas.

# Error_alreadyLogged
source: You are already logged in
es_mx: No se puede iniciar sesión: ya tienes una sesión activa.

# MatchDetails_errorLeft
source: An error ocurred: leaving match
es_mx: Error: saliendo de la partida

# MatchDetails_createError
source: An error ocurred: creating match
es_mx: Error: creando partida

# Error_serverConnection
source: An error ocurred while trying to connect to the server, try again later.
es_mx: Ocurrió un error al intentar conectarse al servidor, intente nuevamente.

# Register_success
source: Your account has been succesfully created!
es_mx: Su cuenta ha sido creada exitosamente!

# UserCard
source: Add friend
es_mx: Añadir amigo

# PlayerCard
source: Waiting for a player
es_mx: Esperando jugador

# ModifyPassword_passwordModified
source: Your password has been modified succesfully
es_mx: Su contraseña ha sido actualizada exitosamente

# JoinMatch_unableToJoin
source: An error ocurred while trying to join the match
es_mx: Error al unirse a la partida

# Register_incorrectData
source: Invalid data
es_mx: Datos incorrectos

# Register_creationSuccess
source: Register success
es_mx: Cuenta creada

# Register_creationFailure
source: An error ocurred while creating your account
es_mx: Error al crear cuenta
